{
    "_class_name": "WFVAEModel",
    "_diffusers_version": "0.30.2",
    "base_channels": 160,
    "connect_res_layer_num": 1,
    "decoder_energy_flow_hidden_size": 128,
    "decoder_num_resblocks": 2,
    "dropout": 0.0,
    "encoder_energy_flow_hidden_size": 128,
    "encoder_num_resblocks": 2,
    "l1_dowmsample_block": "Downsample",
    "l1_downsample_wavelet": "HaarWaveletTransform2D",
    "l1_upsample_block": "Upsample",
    "l1_upsample_wavelet": "InverseHaarWaveletTransform2D",
    "l2_dowmsample_block": "Downsample",
    "l2_downsample_wavelet": "HaarWaveletTransform2D",
    "l2_upsample_block": "Upsample",
    "l2_upsample_wavelet": "InverseHaarWaveletTransform2D",
    "latent_dim": 4,
    "norm_type": "layernorm",
    "vocab_size": 1000, 
    "hidden_size": 1024, 
    "num_heads": 16, 
    "mlp_ratio": 4.0, 
    "num_textblocks": 8, 
    "num_mmblocks": 16, 
    "projection_dim": 768, 
    "use_clip_loss": false, 
    "train_image": true, 
    "train_text": false
 }